Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: An additional user interface, shown in Figure 2, displays previous fight statistics, including the percentage of wins for heroes vs. villains and the top 10 winners and the number of wins for each.
ja_jp: 図2に示す追加のユーザーインターフェースでは、ヒーロー対ヴィランの勝率や上位10人の勝率とそれぞれの勝数など、過去の対戦統計が表示されます。

source: An advantage of this approach is that the configuration is simple and easy to understand, while its disavantage is that a remote OIDC metadata discovery call is required to discover an introspection endpoint address (though the verification keys will also not be fetched).
ja_jp: この方法の利点は、設定がシンプルでわかりやすいことですが、欠点は、イントロスペクションのエンドポイントアドレスを発見するために、リモートOIDCメタデータディスカバリー呼び出しが必要なことです（検証キーもフェッチされない）。

source: An advantage of this approach is that the configuration is simpler and easier to understand. A disadvantage is that a remote OIDC metadata discovery call is required to discover an introspection endpoint address, even though the verification keys will not be fetched.
ja_jp: この方法の利点は、設定がよりシンプルで理解しやすいことです。 欠点は、検証キーが取得されない場合でも、イントロスペクションエンドポイントアドレスを検出するためにリモート OIDC メタデータ検出呼び出しが必要になることです。

source: An advantage of this indirect enforcement of JWT tokens being only introspected remotely is that two remote call are avoided: a remote OIDC metadata discovery call followed by another remote call fetching the verification keys which will not be used, while its disavantage is that the users need to know the introspection endpoint address and configure it manually.
ja_jp: JWTトークンがリモートでイントロスペクションされるだけのこの間接的な実施方法の利点は、2つのリモートコールが避けられることです。リモートOIDCメタデータディスカバリー呼出と、続く使用されない検証キーを取得する別のリモートコールを避けることが出来ます。一方欠点として、ユーザーがイントロスペクションエンドポイントアドレスを知って、それを手動で構成する必要があることです。

source: An alternate solution is to directly provide a keystore which already contains a default entry with a certificate You will need to at least provide the file and a password.
ja_jp: 別の解決策としては、すでに証明書付きのデフォルトのエントリーを含むキーストアを直接提供する方法もあります。 少なくともファイルとパスワードを提供する必要があります。

source: An alternate solution is to directly provide a keystore which already contains a default entry with a certificate. You will need to at least provide the file and a password.
ja_jp: 別の解決策としては、すでに証明書付きのデフォルトのエントリーを含むキーストアを直接提供する方法もあります。 少なくともファイルとパスワードを提供する必要があります。

source: An alternative method to generate flame graphs is to pass in `-H:+PreserveFramePointer` when generating the native executable instead of generating the DWARF debug information. It instructs the binary to use an extra register for the frame pointer. This enables `perf` to do stack walking to profile the runtime behaviour. To generate the native executable using these flags, do the following:
ja_jp: フレームグラフを生成する別の方法として、ネイティブ実行可能ファイルを生成する際に、DWARFのデバッグ情報を生成する代わりに、 `-H:+PreserveFramePointer` を渡す方法があります。これは、フレームポインタに追加のレジスタを使用するようにバイナリに指示します。これにより、 `perf` は、実行時の動作をプロファイリングするためにスタックウォーキングを行うことができます。これらのフラグを使用してネイティブ実行可能ファイルを生成するには、以下のようにします。

source: An alternative way to enforce a singleton while relying static fields, or enums, is to <<delay-class-init-in-your-app,delay its class initialization until run time>>. The nice advantage of CDI-based singletons is that your class initialization is not constrained, so you can freely decide whether it should be build-time or run-time initialized, depending on your use case.
ja_jp: 静的フィールドや列挙型に依存しながらシングルトンを強制する別の方法は、<<delay-class-init-in-your-app,delay its class initialization until run time>> を行うことです。CDIベースのシングルトンの良い利点は、クラスの初期化が制約されないので、ユースケースに応じて、ビルド時または実行時に初期化されるべきかを自由に決定できることです。

source: An alternative way to enforce a singleton while relying static fields, or enums, is to xref:delay-class-init-in-your-app[delay its class initialization until run time]. The nice advantage of CDI-based singletons is that your class initialization is not constrained, so you can freely decide whether it should be build-time or run-time initialized, depending on your use case.
ja_jp: 静的フィールドや列挙型に依存しながらシングルトンを強制する別の方法として、 xref:delay-class-init-in-your-app[クラスの初期化を実行時まで遅らせるという] 方法があります。CDIベースのシングルトンの良い点は、クラスの初期化が制約されないので、ユースケースに応じて、ビルド時に初期化するか、実行時に初期化するかを自由に決められることです。

source: An anchor, also called an ID, can be defined almost anywhere in the document, including on a section title, discrete heading, paragraph, image, delimited block, inline phrase, etc.
ja_jp: アンカー (ID とも呼ばれます) は、セクションタイトル、個別の見出し、段落、イメージ、区切られたブロック、インラインフレーズなど、ドキュメント内のほぼどこにでも定義できます。

source: An application developer can focus on the business logic rather than finding out "where and how" to obtain a fully initialized component with all of its dependencies.
ja_jp: アプリケーション開発者は、「どこで、どのように」ではなく、ビジネスロジックに集中して、すべての依存関係を持つ完全に初期化されたコンポーネントを得ることができます。

source: An application often needs to combine messaging with other parts of the application, ex. produce messages from HTTP endpoints, or stream consumed messages as a response.
ja_jp: アプリケーションでは、多くの場合、メッセージングをアプリケーションの他の部分と組み合わせる必要があります。たとえば、HTTP エンドポイントからメッセージを生成したり、消費されたメッセージをレスポンスとしてストリーミングしたりする必要があります。

source: An arbitrary string referencing a built-in implementation. Available values are detailed in the documentation of each configuration property, such as `async`/`read-sync`/`write-sync`/`sync` for <<quarkus-hibernate-search-orm-elasticsearch_quarkus-hibernate-search-orm-indexing-plan-synchronization-strategy,`quarkus.hibernate-search-orm.indexing.plan.synchronization.strategy`>>.
ja_jp: 組み込み実装を参照する任意の文字列。 利用可能な値については、各設定プロパティーのドキュメントに詳細が記載されています (<<quarkus-hibernate-search-orm-elasticsearch_quarkus-hibernate-search-orm-indexing-plan-synchronization-strategy,`quarkus.hibernate-search-orm.indexing.plan.synchronization.strategy`>> の `async`/`read-sync`/`write-sync`/`sync` など)。

source: An arbitrary string referencing a built-in implementation. Available values are detailed in the documentation of each configuration property, such as `async`/`read-sync`/`write-sync`/`sync` for <<quarkus-hibernate-search-orm-elasticsearch_quarkus.hibernate-search-orm.automatic-indexing.synchronization.strategy,`quarkus.hibernate-search-orm.automatic-indexing.synchronization.strategy`>>.
ja_jp: ビルトイン実装を参照する任意の文字列。 `async` `read-sync` `write-sync` `sync` 利用可能な値は、各設定プロパティーのドキュメントで詳しく説明されています。 link:#quarkus-hibernate-search-orm-elasticsearch_quarkus.hibernate-search-orm.automatic-indexing.synchronization.strategy[`quarkus.hibernate-search-orm.automatic-indexing.synchronization.strategy`] .

source: An arbitrary string referencing a built-in implementation. Available values are detailed in the documentation of each configuration property, such as `async`/`read-sync`/`write-sync`/`sync` for <<quarkus-hibernate-search-standalone-elasticsearch_quarkus-hibernate-search-standalone-indexing-plan-synchronization-strategy,`quarkus.hibernate-search-standalone.indexing.plan.synchronization.strategy`>>.
ja_jp: 組み込み実装を参照する任意の文字列。 利用可能な値については、各設定プロパティーのドキュメントに詳細が記載されています (<<quarkus-hibernate-search-standalone-elasticsearch_quarkus-hibernate-search-standalone-indexing-plan-synchronization-strategy,`quarkus.hibernate-search-standalone.indexing.plan.synchronization.strategy`>> の `async`/`read-sync`/`write-sync`/`sync` など)。

source: An architecture with a compact core and extensions, allowing for rapid expansion, which will nurture innovation
ja_jp: コンパクトなコアとエクステンションを持ち、迅速な拡張を可能にすることで、イノベーションを育むアーキテクチャ

source: An array of entity names that should be re-indexed. If unspecified or empty, all entity types will be re-indexed.
ja_jp: インデックスを再作成する必要があるエンティティー名の配列。指定されていないか空の場合は、すべてのエンティティータイプのインデックスが再作成されます。

source: An array of tenant ids, in case of multi-tenancy. If unspecified or empty, all tenants will be re-indexed.
ja_jp: マルチテナンシーの場合のテナント ID の配列。指定されていないか空の場合、すべてのテナントのインデックスが再作成されます。

source: An asynchronous `HttpServerStart` observer method may be declared by annotating an `HttpServerStart` parameter with `@jakarta.enterprise.event.ObservesAsync`.
ja_jp: 非同期の `HttpServerStart` オブザーバーメソッドは、`HttpServerStart` パラメーターに `@jakarta.enterprise.event.ObservesAsync` をアノテーションすることで宣言できます。

source: An asynchronous observer method is executed using the default blocking executor service.
ja_jp: 非同期オブザーバーメソッドは、デフォルトのブロッキングエグゼキューターサービスを使用して実行されます。

source: An asynchronous response to send to the client instead of continuing the filter chain, or `null` if the filter chain should proceed
ja_jp: フィルターチェーンを続行する代わりにクライアントに送信する非同期レスポンス、またはフィルターチェーンを続行する必要がある場合は null

source: An asynchronous response to send to the client when the exception occurs
ja_jp: 例外が発生したときにクライアントに送信する非同期レスポンス

source: An authentication scheme: `Bearer`
ja_jp: 認証スキーム: `Bearer`

source: An authenticator device may be shared by multiple users, because a single person may want multiple user accounts with different usernames, all of which having the same authenticator device. So a single credential ID may be used by multiple different users.
ja_jp: 一人の人が異なるユーザー名で複数のユーザーアカウントを持ち、その全員が同じ認証デバイスを持つことができるため、認証デバイスは複数のユーザーで共有されることがあります。そのため、1つのクレデンシャルIDを複数の異なるユーザーが使用することがあります。

source: An easy way to access the local storage in a safe way. This will store values in the local storage, which is scoped for your extension. This way, you do not have to worry that you might clash with another extension.
ja_jp: 安全にローカルストレージにアクセスできる方法です。これにより、エクステンションをスコープとするローカルストレージに値が保存されます。この方法では、別のエクステンションと競合する心配はありません。

source: An easy way to configure the required user credentials for Basic authentication to work is to configure the user name, secret, and roles directly in the `application.properties` file.
ja_jp: Basic認証が機能するために必要なユーザークレデンシャルを設定する簡単な方法は、 `application.properties` ファイルで直接ユーザー名、シークレット、ロールを設定することです。

source: An editor or IDE that provides syntax highlighting and previews for AsciiDoc, either natively or using a plugin.
ja_jp: 組込機能またはプラグインを使用して、AsciiDocの構文の強調表示とプレビューを提供するエディターまたは IDE。

source: An editor or IDE that provides syntax highlighting and previews for AsciiDoc, either natively or with a plugin.
ja_jp: 組込機能またはプラグインを使用して、AsciiDocの構文の強調表示とプレビューを提供するエディターまたは IDE。

source: An editor or IDE that provides syntax highlighting and previews for asciidoc, either natively or using a plugin.
ja_jp: ネイティブまたはプラグインを使用して、asciidoc の構文の強調表示とプレビューを提供するエディターまたは IDE。

source: An encrypted PEM keystore configuration example:
ja_jp: 暗号化された PEM キーストアの設定例:

source: An endpoint may declare multiple methods annotated with `@io.quarkus.websockets.next.OnError`. However, each method must declare a different error parameter. The method that declares a most-specific supertype of the actual exception is selected.
ja_jp: エンドポイントは、 `@io.quarkus.websockets.next.OnError` アノテーションが付与された複数のメソッドを宣言できます。 ただし、各メソッドは異なるエラーパラメーターを宣言する必要があります。 実際の例外の最も具体的なスーパータイプを宣言するメソッドが選択されます。

source: An endpoint method annotated with `@OnClose` may also accept the `io.quarkus.websockets.next.CloseReason` parameter that may indicate a reason for closing a connection.
ja_jp: `@OnClose` アノテーションが付与されたエンドポイントメソッドは、接続を閉じる理由を示す `io.quarkus.websockets.next.CloseReason` パラメーターも受け入れる場合があります。

source: An enum constant is validated if the tested value has a type information available and resolves to an enum type.
ja_jp: enum 定数は、テストされた値が利用可能な型情報を持ち、列挙型に解決された場合に検証されます。

source: An error is thrown at build time if any endpoint violates these rules. The static nested classes representing sub-websockets adhere to the same guidelines.
ja_jp: いずれかのエンドポイントがこれらのルールに違反すると、ビルド時にエラーがスローされます。 sub-websocket を表す静的なネストされたクラスは同じガイドラインに従います。

source: An even nastier possible outcome could be for no exception to be thrown, but instead the JSON result would be completely empty.
ja_jp: さらに厄介なのは、例外がスローされずに JSON の結果が完全に空になってしまうことです。

source: An event with qualifier `@Initialized(RequestScoped.class)` is fired when the request context is initialized for an observer notification. Moreover, the events with qualifiers `@BeforeDestroyed(RequestScoped.class)` and `@Destroyed(RequestScoped.class)` are fired when the request context is destroyed.
ja_jp: オブザーバー通知のためにリクエストコンテキストが初期化されると、修飾子 `@Initialized(RequestScoped.class)` を持つイベントが発生します。さらに、修飾子 `@BeforeDestroyed(RequestScoped.class)` および `@Destroyed(RequestScoped.class)` を持つイベントは、リクエストコンテキストが破棄されたときに発生します。

source: An event-driven reactive programming API
ja_jp: イベントドリブンなリアクティブプログラミングAPI

source: An example configuration could be:
ja_jp: コンフィギュレーションの例は次のようになります:

source: An example configuration follows:
ja_jp: 以下に設定例を示します:

source: An example configuration for setting proxy:
ja_jp: プロキシーを設定するための設定例:

source: An example configuration for specifying keystores and truststores:
ja_jp: キーストアとトラストストアを指定するための設定例:

source: An example explaining how to deploy verticles during the initialization of the application will follow.
ja_jp: アプリケーションの初期化時にVerticleをデプロイする方法については、次の例で説明します。

source: An example file is shown below:
ja_jp: ファイルの例を以下に示します。

source: An example for defining access to a database with no built-in support in JVM mode:
ja_jp: JVMモードで、組込サポートのないデータベースへのアクセスを定義する例：

source: An example from a native executable:
ja_jp: ネイティブ実行可能ファイルの例。

source: An example from native execution:
ja_jp: ネイティブの実行例：

source: An example logging configuration:
ja_jp: ロギング設定の例:

source: An example looks like the following:
ja_jp: 例は次のようになります:

source: An example of Configuring the filter in `application.properties`:
ja_jp: `application.properties` におけるフィルターの設定例：

source: An example of a `Person` class defined as a Kotlin data class would look like:
ja_jp: Kotlinのデータクラスとして定義された `Person` クラスの例は次のようになります。

source: An example of a certificate supplier:
ja_jp: 証明書サプライヤーの例:

source: An example of a conditional build step
ja_jp: 条件付きビルドステップの例

source: An example of a full CORS filter configuration that includes a regular expression defining an allowed origin
ja_jp: 許可されたオリジンを定義す る 正規表現を含む完全な CORS フ ィ ル タ ー設定の例

source: An example of a global configuration that applies to all categories:
ja_jp: すべてのカテゴリーに適用されるグローバル設定の例:

source: An example of a per-category configuration:
ja_jp: カテゴリーごとの設定例:

source: An example of configuring multiple Mongo Clients for runtime selection:
ja_jp: 実行時選択のための複数の Mongo クライアントの設定例:

source: An example of configuring multiple Redis Clients for runtime selection:
ja_jp: 実行時選択のために複数の Redis クライアントを設定する例

source: An example of configuring multiple datasources for runtime selection:
ja_jp: 複数のデータソースを実行時に選択できるように設定する例：

source: An example of dynamic GraphQL client
ja_jp: 動的 GraphQL クライアントの例

source: An example of enabling Web Links support would look like:
ja_jp: Web リンクのサポートを有効にする例は次のようになります。

source: An example of how you can set the default log level to `INFO` logging and include Hibernate `DEBUG` logs:
ja_jp: デフォルトのログレベルを `INFO` ログに設定し、Hibernate `DEBUG` ログを含める方法の例です：

source: An example of manually reloading a TLS configuration and notifying components by firing a `CertificateUpdatedEvent` and reacting to it:
ja_jp: TLS 設定を手動で再読み込みし、`CertificateUpdatedEvent` を発生させてそれに反応することでコンポーネントに通知する例:

source: An example of parsing a XML config file using JAXB is shown in the `TestProcessor#parseServiceXmlConfig` method: .Parsing an XML Configuration into Runtime XmlConfig Instance
ja_jp: JAXB を使用して XML 設定ファイルを解析する例を `TestProcessor#parseServiceXmlConfig` メソッドで示します： .XML 設定を実行時XmlConfig インスタンスにパース

source: An example of parsing an XML config file using JAXB is shown in the `TestProcessor#parseServiceXmlConfig` method:
ja_jp: JAXB を使用して XML 設定ファイルを解析する例を `TestProcessor#parseServiceXmlConfig` メソッドに示します。

source: An example of parsing an XML config file using JAXB is shown in the `TestProcessor#parseServiceXmlConfig` method: .Parsing an XML Configuration into Runtime XmlConfig Instance
ja_jp: JAXBを使用したXMLコンフィグファイルの解析例を `TestProcessor#parseServiceXmlConfig` メソッドに示しました .XML設定を実行時XmlConfigインスタンスにパース

source: An example of simplified logging using static method calls:
ja_jp: 静的メソッド呼び出しを使った簡易ロギングの例：

source: An example of simplified logging with static method calls:
ja_jp: 静的メソッド呼び出しを使用した簡素化されたロギングの例:

source: An example of storing a logger instance into a static field by using the JBoss Logging API:
ja_jp: JBoss Logging API を使用してロガーインスタンスを静的フィールドに格納する例：

source: An example of such a file is the following:
ja_jp: このようなファイルの例を以下に示します：

source: An example of such a report could be:
ja_jp: そのようなレポートの例としては次のようになります:

source: An example of the `PersonChecker` could be:
ja_jp: `PersonChecker` の例は次のとおりです。

source: An example of the `ServiceBinding` resource:
ja_jp: 以下は、`ServiceBinding` リソースの例です。

source: An example of this can be seen in the following snippet:
ja_jp: この例は、次のスニペットの通りです:

source: An example of two different types of logger injection:
ja_jp: 2つの異なるタイプのロガーの注入例：

source: An example of using the JBoss Logging API to log a message:
ja_jp: JBoss Logging API を使用してメッセージをログに記録する例:

source: An example of what this looks like is below:
ja_jp: その一例が以下のようなものです:

source: An example of writing a filter:
ja_jp: フィルターの書き方の例:

source: An example output using Dev Services for PostgreSQL is the following:
ja_jp: Dev Services for PostgreSQLを使用した出力例は以下の通りです。

source: An example prerequisite with callout explanations
ja_jp: コールアウト付きの前提条件の例

source: An example properties file is generated into the target directory for each message bundle interface automatically. For example, by default if no name is specified for `@MessageBundle` the file `target/qute-i18n-examples/msg.properties` is generated when the application is build via `mvn clean package`. You can use this file as a base for a specific locale. Just rename the file - e.g. `msg_fr.properties`, change the message templates and move it in the `src/main/resources/messages` directory.
ja_jp: メッセージバンドルインターフェイスごとに、ターゲットディレクトリーにサンプルのプロパティーファイルが自動的に生成されます。たとえば、デフォルトで `@MessageBundle` に名前が指定されない場合、`mvn clean package` を用いてアプリケーションをビルドすると、`target/qute-i18n-examples/msg.properties` というファイルが生成されます。このファイルは、特定のロケールのベースとして使用することができます。単にファイル名を変更 (例: `msg_fr.properties`) して メッセージのテンプレートを変更し、これを `src/main/resources/messages` ディレクトリーに移動します。

source: An example showing that the value can contain multiple variables.
ja_jp: 値が複数の変数を含むことができることを示す例。

source: An example test class may look like:
ja_jp: テストクラスの例は次のようになります。

source: An example usage can be found in <<chaining-kafka-transactions-with-hibernate-reactive-transactions>>.
ja_jp: 使用例については、<<chaining-kafka-transactions-with-hibernate-reactive-transactions>> を参照してください。

source: An example usage could look like:
ja_jp: 使用例は次のようになります:

source: An example use case can be a desire to use a different timestamp format for log messages which are saved to a file than the format used for other handlers.
ja_jp: ユースケース例としては、ファイルに保存されるログメッセージに、他のハンドラで使用されるフォーマットとは異なるタイムスタンプ形式を使いたい場合があります。

source: An example use of this could be the following Maven command, that forces `@QuarkusIntegrationTest` to execute against that is accessible at `http://1.2.3.4:4321`:
ja_jp: 次の Maven コマンドはその使用例で、 `@QuarkusIntegrationTest` を強制的に実行し、 `http://1.2.3.4:4321` からアクセスできます:

source: An example using the `client-credentials` grant type needs only a minor adjustments:
ja_jp: `client-credentials` のグラントタイプを使用した例では、わずかな調整で済みます:

source: An example where a custom module needs to be registered would look like so:
ja_jp: カスタムモジュールを登録する必要がある場合の例は次のようになります。

source: An example with JBoss Logging and `io.quarkus.logging.Log`
ja_jp: JBoss Logging と `io.quarkus.logging.Log` の例

source: An exception argument: declared as a general `Exception` or as a more specific exception. This also serves as a mapping hint if the annotation itself does not narrow the exception types through its `value()`.
ja_jp: 例外の引数：一般的な `Exception` として、またはより具体的な例外として宣言されています。これは、アノテーション自体が `value()` を使って例外の型を狭めていない場合、マッピングのヒントにもなります。

source: An exception type
ja_jp: 例外型

source: An execution of a scheduled job completed successfully.
ja_jp: スケジュールされたジョブの実行が正常に完了しました。

source: An execution of a scheduled job completed with an exception.
ja_jp: スケジュールされたジョブの実行が例外を伴って完了しました。

source: An execution of a scheduled job was skipped.
ja_jp: スケジュールされたジョブの実行がスキップされました。

source: An explicit CDI scope annotation (`@RequestScoped`, `@ApplicationScoped`, etc.) always overrides the default behavior and specifies the lifecycle of resource instances.
ja_jp: 明示的な CDI スコープアノテーション (`@RequestScoped`、`@ApplicationScoped` など) は、常にデフォルトの動作をオーバーライドし、リソースインスタンスのライフサイクルを指定します。

source: An expression can start with an optional namespace followed by a colon (`:`). A valid namespace consist of alphanumeric characters and underscores. Namespace expressions are resolved differently - see also <<expression_resolution>>.
ja_jp: 式は、名前空間の後にコロン (`:`) を付けて開始することができます。有効な名前空間は英数字とアンダースコアで構成されます。名前空間の式は別の方法で解決されます。<<expression_resolution>> も参照してください。

source: An expression can start with an optional namespace followed by a colon (`:`). A valid namespace consist of alphanumeric characters and underscores. Namespace expressions are resolved differently - see also xref:expression_resolution[Resolution].
ja_jp: 式は、オプションの名前空間の後にコロン（ `:` ）を付けて始めることができます。有効な名前空間は、英数字とアンダースコアで構成されます。名前空間式は、解決方法が異なります - xref:expression_resolution[解決] 方法も参照してください。

source: An expression can start with an optional namespace followed by a colon (`:`). A valid namespace consists of alphanumeric characters and underscores. Namespace expressions are resolved differently - see also <<expression_resolution>>.
ja_jp: 式は、名前空間の後にコロン (`:`) を付けて開始できます。 有効な名前空間は英数字とアンダースコアで構成されます。 名前空間の式は別の方法で解決されます。<<expression_resolution>> も参照してください。

source: An expression is evaluated and outputs the value. It has one or more parts, where each part represents either a property accessor (aka Field Access Expression) or a virtual method invocation (aka Method Invocation Expression).
ja_jp: 式が評価され、値が出力されます。これには 1 つ以上のパーツがあり、各パーツはプロパティーアクセサー (別名 Field Access Expression) または仮想メソッド呼び出し (別名 Method Invocation Expression) のいずれかを表します。

source: An extension can define Assistant features without depending on Chappie directly. The interfaces and associated structures are located in the `assistant` extension.
ja_jp: エクステンションは、 Chappie に直接依存することなくアシスタント機能を定義できます。インターフェースと関連する構造体は `assistant` エクステンションにあります。

source: An extension can produce an <<cdi-reference.adoc#additional_beans,`AdditionalBeanBuildItem`>> to instruct the container to read a bean definition from a class as if it was part of the original application:
ja_jp: エクステンションは link:cdi-reference.html#additional_beans[`AdditionalBeanBuildItem`] コンテナに、元のアプリケーションの一部であるかのようにクラスからBeanの定義を読み込むように指示します。

source: An extension can produce an xref:cdi-integration.adoc#additional_bean_build_item[`AdditionalBeanBuildItem`] to instruct the container to read a bean definition from a class as if it was part of the original application:
ja_jp: エクステンションは xref:cdi-integration.adoc#additional_bean_build_item[`AdditionalBeanBuildItem`] を生成して、元のアプリケーションの一部であるかのようにクラスからビーン定義を読み取るようにコンテナに指示することができます。

source: An extension hosts Substrate VM code substitution so that libraries can run on GraalVM
ja_jp: エクステンションは Substrate VM のコード置換をホストし、ライブラリを GraalVM 上で実行できるようにします。

source: An extension is available to help test extension codestarts `QuarkusCodestartTest`. It provides a way to test:
ja_jp: エクステンション codestarts のテストに役立つエクステンションが用意されています `QuarkusCodestartTest` 。テストする方法を提供します:

source: An extension is available to help test extension codestarts `QuarkusCodestartTest`:
ja_jp: エクステンションの Codestart をテストするためのエクステンション `QuarkusCodestartTest` が利用可能です。

source: An extension may pre-configure certain Java command line options that should be added to the command line launching an application in Dev mode. Here is how such options can be configured in the `quarkus-extension-maven-plugin` configuration:
ja_jp: エクステンションは、開発モードでアプリケーションを起動する際に、コマンドラインに追加すべき特定の Java コマンドラインオプションを事前に設定できます。以下に、そのようなオプションを `quarkus-extension-maven-plugin` の設定で構成する方法を示します。
